app/views/comments/_comment.html.erb

INSERT INTO "comments" ("body", "com", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "good"], ["com", "47wang"], ["created_at", Thu, 04 Oct 2012 07:21:09 UTC +00:00], ["post_id", 1], ["updated_at", Thu, 04 Oct 2012 07:21:09 UTC +00:00]]
---
	<p>
	<strong>Posted <%=time_ago_in_words(comment.created_at) %> ago