app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "com", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "good"], ["com", "47wang"], ["created_at", Thu, 04 Oct 2012 07:21:09 UTC +00:00], ["post_id", 1], ["updated_at", Thu, 04 Oct 2012 07:21:09 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(params[:comment])