app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO "posts" ("body", "created_at", "owner", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save